#! /usr/bin/env lua
--
-- select_character_tran.lua
-- Copyright (C) 2022 Shewer Lu <shewer@gmail.com>
--
-- Distributed under terms of the MIT license.
-- select_character 配件 
-- lua_translator@select_character_tran
local S={
  nu=[[一二三四五六七八九〇㈠㈡㈢㈣㈤㈥㈦㈧㈨㈩❶❷❸❹❺❻❼❽❾❿⒈⒉⒊⒋⒌⒍⒎⒏⒐⒑⒒⒓⒔⒕⒖⒗⒘⒙⒚⒛⑴⑵⑶⑷⑸⑹⑺⑻⑼⑽⑾⑿⒀⒁⒂⒃⒄⒅⒆⒇①②③④⑤⑥⑦⑧⑨⑩⑪⑫⑬⑭⑮⑯⑰⑱⑲⑳㉑㉒㉓㉔㉕㉖㉗㉘㉙㉚㉛㉜㉝㉞㉟㊱㊲㊳㊴㊵㊶㊷㊸㊹㊺㊻㊼㊽㊾㊿❶❷❸❹❺❻❼❽❾❿⓫⓬⓭⓮⓯⓰⓱⓲⓳⓴壹貳叄肆伍陸柒捌玖零拾佰千萬億兆]],
  sma=[[ ©®℗℠™℡℻☇☈☉☊☋☌☍☎☏☐☑☒☓☕☖☗⛉⛊☘☙☚☛☜☝☞☟☠☡☢☣☤☥☦☧☨☩☪☫☬☭☮☯☸♨♰♱♲♳♴♵♶♷♸♹♺♻♼♽♾♿⚆⚇⚈⚉⚐⚑⚒⚓⚔⚕⚖⚗⚘⚙⚚⚛⚜⚝⚞⚟⚠⚡⚰⚱⚲⚳⚴⚵⚶⚷⚸⚹⚺⚻⚼⚽⚾⚿⛀⛁⛂⛃⛋⛌⛍⛎⛏⛐⛑⛒⛓⛔⛕⛖⛗⛘⛙⛚⛛⛜⛝⛞⛟⛠⛡⛢⛣⛨⛩⛪⛫⛬⛭⛮⛯⛰⛱⛲⛳⛴⛵⛶⛷⛸⛹⛺⛻⛼⛽⛾⛿■□▢▣▤▥▦▧▨▩▪▫▬▭▮▯▰▱▲△▴▵▶▷▸▹►▻▼▽▾▿◀◁◂◃◄◅◆◇◈◉◊○◌◍◎●◐◑◒◓◔◕◖◗◘◙◚◛◜◝◞◟◠◡◢◣◤◥◦◧◨◩◪◫◬◭◮◯◰◱◲◳◴◵◶◷◸◹◺◻◼◽◾◿ ]],
  smb=[[ ↑↓←→↕↔↖↗↙↘↚↛↮↜↝↞↟↠↡↢↣↤↥↦↧↨↩↪↫↬↭↯↰↱↲↳↴↵↶↷↸↹↺↻↼↽↾↿⇀⇁⇂⇃⇄⇅⇆⇇⇈⇉⇊⇋⇌⇐⇍⇑⇒⇏⇓⇔⇎⇕⇖⇗⇘⇙⇚⇛⇜⇝⇞⇟⇠⇡⇢⇣⇤⇥⇦⇧⇨⇩⇪⇫⇬⇭⇮⇯⇰⇱⇲⇳⇴⇵⇶⇷⇸⇹⇺⇻⇼⇽➔➘➙➚➛➜➝➞➟➠➡➢➣➤➥➦➧➨➩➪➫➬➭➮➱➲➳➴➵➶➷➸➹➺➻➼➽➾ ]],
smc= [[±÷×∈∏∑－＋＜≮＝≠＞≯∕√∝∞⟨⟩∟∠∥∧∨∩∪∫∮∴∵∷∽≈≌≒≡≤≥≦≧⊕⊙⊥⊿㏑㏒
❖⌘⌃⌥⎇⇧⇪␣⇥⇤↩⌅⌤⌫⌦⌧⎋⌨◁⌀⌖⌗⏏↖↘⇞⇟⌚⏰⏱⏲⏳⌛⌜⌝⌞⌟⍑⏩⏪⏫⏬⏭⏮⏯♂♀⚢⚣⚤⚥⚦⚧⚨⚩⚪⚫⚬⚭⚮⚯
★☆⛤⛥⛦⛧✡❋❊❉❈❇❆❅❄❃❂❁❀✿✾✽✼✻✺✹✸✷✶✵✴✳✲✱✰✯✮✭✬✫✪✩✧✦✥✤✣✢ ]],
alp=[[⒜⒝⒞⒟⒠⒡⒢⒣⒤⒥⒦⒧⒨⒩⒪⒫⒬⒭⒮⒯⒰⒱⒲⒳⒴⒵
ⓐⓑⓒⓓⓔⓕⓖⓗⓘⓙⓚⓛⓜⓝⓞⓟⓠⓡⓢⓣⓤⓥⓦⓧⓨⓩⒶⒷⒸⒹⒺⒻⒼⒽⒾⒿⓀⓁⓂⓃⓄⓅⓆⓇⓈⓉⓊⓋⓌⓍⓎⓏ]],
smc= [[ㄅㄆㄇㄈㄉㄊㄋㄌㄍㄎㄏㄐㄑㄒㄓㄔㄕㄖㄗㄘㄙㄧㄨㄩㄚㄛㄜㄝㄞㄟㄠㄡㄢㄣㄤㄥㄦ
㏠㏡㏢㏣㏤㏥㏦㏧㏨㏩㏪㏫㏬㏭㏮㏯㏰㏱㏲㏳㏴㏵㏶㏷㏸㏹㏺㏻㏼㏽㏾
㋀㋁㋂㋃㋄㋅㋆㋇㋈㋉㋊㋋
㍙㍚㍛㍜㍝㍞㍟㍠㍡㍢㍣㍤㍥㍦㍧㍨㍩㍪㍫㍬㍭㍮㍯㍰㍘
㈪㈫㈬㈭㈮㈯㈰㈱㈲㈳㈴㈵㈶㈷㈸㈹㈺㈻㈼㈽㈾㈿㉀㉁㉂㉃]],
emj=[[😀😃😄😁😆😅🤣😂🙂🙃😉😊😇🥰😍🤩😘😗😚😙🥲😋😛😜🤪😝🤑🤗🤭🤫🤔🤐🤨😐😑😶😏😒🙄😬🤥😌😔😪🤤😴😷🤒🤕
🤢🤮🤧🥵🥶🥴😵🤯🤠🥳🥸😎🤓🧐😕😟🙁☹️😮😯😲😳🥺😦😧😨😰😥😢😭😱😖😣😞😓😩😫🥱😤😡😠🤬😈👿💀☠️🤡
👹👺👻👽👾🤖😺😸😹😻😼😽🙀😿😾🙈🙉🙊💋💌💯💢💤
💘💝💖💗💓💞💕💟❣️💔❤️❤️❤️🧡💛💚💙💜🤎🖤🤍
💥💫💦💨🕳💣💬👁🗨🗯💭
☇☈☉☊☋☌☍☎☏☐☑☒]]
}


local puts = require 'tools/debugtool'
require 'tools/string'
local M={}
function M.init(env)
  env.pattern = "^/(%a+)$"
  env.base=10
end
function M.fini(env)
end
function M.func(input,seg,env)
  local base = env.base
  local active_input=input:match(env.pattern) 
  if not S[active_input] then return end
  
  S[active_input]:split("%s"):each(function(str) 
    for i=1, #str//base +1 do 
      local substr= str:utf8_sub((i-1)*base+1, i*base) 
      if #substr == 0 then return end
      yield(Candidate( "symble",seg.start,seg._end,substr,"") )
    end
  end)
end

return M


